def weather():
    a = float(input("Введіть температуру на вулиці: "))
    if a >= 25:
        print("Одягайте легкий одяг, наприклад, футболку та шорти, на вулиці спекотно")
    elif a >= 18:
        print("Одягайте легку та притаманну для літа одежу, на вулиці тепло, але не спекотно")
    elif a >= 12:
        print("Одягайте більш теплішу одежу, наприклад, кофту або светр, на вулиці прохолодно, погода зовсім не літня")
    elif a >= 0:
        print("Одягайтесь тепло: куртка, шапка, на вулиці холодно")
    else:
        print("Одягайтесь дуууже тепло, на вулиці дуже холодно")
weather()