name = {
    "Рома": {
        "робота": "бухгалтер",
        "зарплата": "25000",
        "почав працювати": "04.10.2023",
        "дні, коли працює": "понеділок, середа, п'ятниця, субота"
    },
    "Олексій": {
        "робота": "менеджер",
        "зарплата": "35000",
        "почав працювати": "03.10.2023",
        "дні, коли працює": "понеділок, середа, п'ятниця, субота"
    }
}
while True:
    print("Функції: ")
    print("1 - Додати працівника")
    print("2 - Видалити працівника")
    print("3 - Переглянути всіх працівників")
    print("4 - Змінити зарплату працівнику")
    print("5 - Нічого не змінювати")
    a = input("Введіть цифру: ")
    if a == "1":
        name2 = input("Введіть ім'я працівника, якого хочете додати: ")
        work = input("Введіть роботу працівника: ")
        salary = input("Введіть зарплату працівника: ")
        date = input("Введіть дату початку роботи працівника: ")
        days = input("Введіть дні тижня, коли працівник буде працювати: ")
        name[name2] = {
            "робота нового працівника: ": work,
            "зарплата нового працівника: ": salary,
            "день, коли працівник розпочав працювати: ": date,
            "дні, коли працівник працює: ": days
        }
    elif a == "2":
        name2 = input("Введіть ім'я працівника, якого хочете видалити: ")
        if name2 in name:
            del name[name2]
        else:
            print("Ця людина не працює на роботі, видалити його не можливо")
    elif a == "3":
        for name, values in name.items():
            print(name)
            for key, value in values.items():
                print(f"{key}: {value}")
    elif a == "4":
        name2 = input("Введіть ім'я працівника, якому треба змінити зарплату: ")
        b = int(input("Введіть нову зарплату працівника: "))
        name[name2]["salary"] = b
        print("зарплата змінена!")
    elif a == "5":
        break
    else:
        print("Це неможливо зробити")
